# CantCopyBetweenModelAndAnnotFam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopyBetweenModelAndAnnotFam Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy element(s) between Model and Annotation families.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopyBetweenModelAndAnnotFam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopyBetweenModelAndAnnotFam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopyBetweenModelAndAnnotFam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace